summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxCan_bf.h
/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETRXPND */
#define IFX_CAN_MO_CTR_STAT_CTR_SETRXPND_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETRXPND */
#define IFX_CAN_MO_CTR_STAT_CTR_SETRXPND_OFF (16)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETRXUPD */
#define IFX_CAN_MO_CTR_STAT_CTR_SETRXUPD_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETRXUPD */
#define IFX_CAN_MO_CTR_STAT_CTR_SETRXUPD_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETRXUPD */
#define IFX_CAN_MO_CTR_STAT_CTR_SETRXUPD_OFF (18)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETTXEN0 */
#define IFX_CAN_MO_CTR_STAT_CTR_SETTXEN0_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETTXEN0 */
#define IFX_CAN_MO_CTR_STAT_CTR_SETTXEN0_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETTXEN0 */
#define IFX_CAN_MO_CTR_STAT_CTR_SETTXEN0_OFF (25)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETTXEN1 */
#define IFX_CAN_MO_CTR_STAT_CTR_SETTXEN1_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETTXEN1 */
#define IFX_CAN_MO_CTR_STAT_CTR_SETTXEN1_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETTXEN1 */
#define IFX_CAN_MO_CTR_STAT_CTR_SETTXEN1_OFF (26)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETTXPND */
#define IFX_CAN_MO_CTR_STAT_CTR_SETTXPND_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETTXPND */
#define IFX_CAN_MO_CTR_STAT_CTR_SETTXPND_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETTXPND */
#define IFX_CAN_MO_CTR_STAT_CTR_SETTXPND_OFF (17)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETTXRQ */
#define IFX_CAN_MO_CTR_STAT_CTR_SETTXRQ_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETTXRQ */
#define IFX_CAN_MO_CTR_STAT_CTR_SETTXRQ_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_CTR_Bits.SETTXRQ */
#define IFX_CAN_MO_CTR_STAT_CTR_SETTXRQ_OFF (24)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_STAT_Bits.DIR */
#define IFX_CAN_MO_CTR_STAT_STAT_DIR_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_STAT_Bits.DIR */
#define IFX_CAN_MO_CTR_STAT_STAT_DIR_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_STAT_Bits.DIR */
#define IFX_CAN_MO_CTR_STAT_STAT_DIR_OFF (11)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_STAT_Bits.LIST */
#define IFX_CAN_MO_CTR_STAT_STAT_LIST_LEN (4)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_STAT_Bits.LIST */
#define IFX_CAN_MO_CTR_STAT_STAT_LIST_MSK (0xf)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_STAT_Bits.LIST */
#define IFX_CAN_MO_CTR_STAT_STAT_LIST_OFF (12)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_STAT_Bits.MSGLST */
#define IFX_CAN_MO_CTR_STAT_STAT_MSGLST_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_STAT_Bits.MSGLST */
#define IFX_CAN_MO_CTR_STAT_STAT_MSGLST_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_STAT_Bits.MSGLST */
#define IFX_CAN_MO_CTR_STAT_STAT_MSGLST_OFF (4)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_STAT_Bits.MSGVAL */
#define IFX_CAN_MO_CTR_STAT_STAT_MSGVAL_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_STAT_Bits.MSGVAL */
#define IFX_CAN_MO_CTR_STAT_STAT_MSGVAL_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_STAT_Bits.MSGVAL */
#define IFX_CAN_MO_CTR_STAT_STAT_MSGVAL_OFF (5)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_STAT_Bits.NEWDAT */
#define IFX_CAN_MO_CTR_STAT_STAT_NEWDAT_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_STAT_Bits.NEWDAT */
#define IFX_CAN_MO_CTR_STAT_STAT_NEWDAT_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_STAT_Bits.NEWDAT */
#define IFX_CAN_MO_CTR_STAT_STAT_NEWDAT_OFF (3)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_STAT_Bits.PNEXT */
#define IFX_CAN_MO_CTR_STAT_STAT_PNEXT_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_STAT_Bits.PNEXT */
#define IFX_CAN_MO_CTR_STAT_STAT_PNEXT_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_STAT_Bits.PNEXT */
#define IFX_CAN_MO_CTR_STAT_STAT_PNEXT_OFF (24)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_STAT_Bits.PPREV */
#define IFX_CAN_MO_CTR_STAT_STAT_PPREV_LEN (8)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_STAT_Bits.PPREV */
#define IFX_CAN_MO_CTR_STAT_STAT_PPREV_MSK (0xff)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_STAT_Bits.PPREV */
#define IFX_CAN_MO_CTR_STAT_STAT_PPREV_OFF (16)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_STAT_Bits.RTSEL */
#define IFX_CAN_MO_CTR_STAT_STAT_RTSEL_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_STAT_Bits.RTSEL */
#define IFX_CAN_MO_CTR_STAT_STAT_RTSEL_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_STAT_Bits.RTSEL */
#define IFX_CAN_MO_CTR_STAT_STAT_RTSEL_OFF (6)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_STAT_Bits.RXEN */
#define IFX_CAN_MO_CTR_STAT_STAT_RXEN_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_STAT_Bits.RXEN */
#define IFX_CAN_MO_CTR_STAT_STAT_RXEN_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_STAT_Bits.RXEN */
#define IFX_CAN_MO_CTR_STAT_STAT_RXEN_OFF (7)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_STAT_Bits.RXPND */
#define IFX_CAN_MO_CTR_STAT_STAT_RXPND_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_STAT_Bits.RXPND */
#define IFX_CAN_MO_CTR_STAT_STAT_RXPND_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_STAT_Bits.RXPND */
#define IFX_CAN_MO_CTR_STAT_STAT_RXPND_OFF (0)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_STAT_Bits.RXUPD */
#define IFX_CAN_MO_CTR_STAT_STAT_RXUPD_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_STAT_Bits.RXUPD */
#define IFX_CAN_MO_CTR_STAT_STAT_RXUPD_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_STAT_Bits.RXUPD */
#define IFX_CAN_MO_CTR_STAT_STAT_RXUPD_OFF (2)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_STAT_Bits.TXEN0 */
#define IFX_CAN_MO_CTR_STAT_STAT_TXEN0_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_STAT_Bits.TXEN0 */
#define IFX_CAN_MO_CTR_STAT_STAT_TXEN0_MSK (0x1)

/** \\brief  Offset for Ifx_CAN_MO_CTR_STAT_STAT_Bits.TXEN0 */
#define IFX_CAN_MO_CTR_STAT_STAT_TXEN0_OFF (9)

/** \\brief  Length for Ifx_CAN_MO_CTR_STAT_STAT_Bits.TXEN1 */
#define IFX_CAN_MO_CTR_STAT_STAT_TXEN1_LEN (1)

/** \\brief  Mask for Ifx_CAN_MO_CTR_STAT_STAT_Bits.TXEN1 */
#define IFX_CAN_MO_CTR_STAT_STAT_TXEN1_MSK (0x1)

